Tekla.Structures.Plugins.PluginUserInterfaceAttribute
The PluginUserInterfaceAttribute class is used for storing the description of the plug-in user interface to the system.
The attribute is initialized from the custom attribute [PluginUserInterface(PluginName.UserInterfaceDefinitions.Plugin1)] in the plug-in source.
In this case the description string Plugin1 is a dialog written in inp format.
If the plug-in dialog is inherited from the PluginFormBase the description string contains a class name of the dialog i.e. [PluginUserInterface("Model_Plug_in1.MainForm")].

Tekla.Structures.Plugins.PluginUserInterfaceAttribute.#ctor(System.String)
The custom attribute [PluginUserInterface(PluginName.UserInterfaceDefinitions.Plugin1)] uses this to store the description of the plug-in user interface to the system.
This is not to be used by itself.
description: The description of the plug-in user interface in inp format or the name of the dialog class for the PluginFormBase dialog.

Tekla.Structures.Plugins.PluginUserInterfaceAttribute.Description
The description of the plug-in user interface in inp format.